artillery/load-test.yml
config:
  target: "https://www.yaret.cloud"
  http:
    timeout: 30
  phases:
    - name: warmup
      duration: 60
      arrivalRate: 2
    - name: ramp
      duration: 120
      arrivalRate: 5
      rampTo: 25
    - name: sustained
      duration: 180
      arrivalRate: 25
    - name: spike
      duration: 60
      arrivalRate: 50
  ensure:
    thresholds:
      - http.response_time.p95: 1500
      - http.response_time.p99: 3000
    conditions:
      - expression: "http.codes.200 > 0"
  defaults:
    headers:
      User-Agent: "artillery-loadtest/djaret"

scenarios:
  - name: "page-then-api"
    flow:
      - get:
          url: "/"
          expect:
            - statusCode: 200
      - get:
          url: "/app.js"
      - get:
          url: "/app.css"
      - get:
          url: "/api/hello/"
          headers:
            Accept: "application/json"
          expect:
            - statusCode: 200
            - contentType: json